#include <stdio.h>
#include <stdlib.h>

/*
 Попытайтесь исполнить эту программу, изменив параметры циклов так, чтобы реально
обрабатываемый массив был меньше объявленного.
 Попытайтесь исполнить эту программу, изменив параметры циклов так, чтобы реально
обрабатываемый массив был больше объявленного.
 Переработайте программу, используя (вместо обращения по индексу) механизм обращения по адресу.
*/

/*
Задание 22
Для квадратной матрицы размера n*n подсчитать среднее арифметическое
элементов каждого столбца, исключая элемент на главной диагонали, и сформиро-
вать из них вектор. Найти минимальный элемент этого вектора.

Решить для динамического и статического массива.
*/

int main()
{

}